---
kind: property
id: P:Autodesk.Revit.DB.ExternallyTaggedGeometryObject.ExternalId
source: html/54c4728b-b8ce-47b3-a67a-5687fb8b7b1b.htm
---
# Autodesk.Revit.DB.ExternallyTaggedGeometryObject.ExternalId Property

The external Id of the geometry object.

## Syntax (C#)
```csharp
public ExternalGeometryId ExternalId { get; }
```